IRP/src/DataProcessors/Chat/Chat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Chat</name>
</mdclass:DataProcessor>

IRP/src/InformationRegisters/Logger/Logger.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Logger</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ManualComment</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>NotifyID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Basis</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TimeStamp</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/DataProcessors/Chat/Forms/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Basis = Parameters.Basis;
	UpdateAtServer();
EndProcedure

&AtServer
Procedure UpdateAtServer()
	
	Query = New Query;
	Query.Text =
		"SELECT
		|	Logger.Period AS Period,
		|	REFPRESENTATION(Logger.User) AS User,
		|	Logger.User = &CurrentUser AS CurrentUser,
		|	Logger.Comment AS Message,
		|	Logger.ManualComment
		|FROM
		|	InformationRegister.Logger AS Logger
		|WHERE
		|	Logger.Basis = &Basis
		|
		|ORDER BY
		|	Period,
		|	Logger.TimeStamp";
	
	Query.SetParameter("Basis", Basis);
	Query.SetParameter("CurrentUser", SessionParameters.CurrentUser);
	Result = Query.Execute().Unload();
	JSON = CommonFunctionsServer.SerializeJSON(CommonFunctionsServer.TableToStructure(Result));
	
	Template = DataProcessors.Chat.GetTemplate("ChatHTML").GetText();
	Chat = StrReplace(Template, "#MessageArray#", JSON);
EndProcedure

&AtClient
Procedure Update(Command)
	UpdateAtServer();
EndProcedure

&AtClient
Procedure SendMessage(Command)
	LoggerServerCall.AddLog(Basis, NewMessage, True);
	NewMessage = "";
	UpdateAtServer();
EndProcedure
